package interface2;

public interface MethodsInterface {

//    Абстарктные методы-без реализации. Что бы вызвать нужно создать обьект класса
//    Дефолтные методы-Создаем обьект чтобы вызвать от наследованного класса, добавить новые функции в уже существующие интерфейсы, не ломая старый код
//    Статические методы-не создавая обьект можно вызвать
//    константа
//    Приватные методы
//    НЕ создается публичные методы
//    int DEFAULT_CONSTANT = 200;

    //Абстаркт класс
    //Поля
    //Константа
    //Конструктор
    //Абстарткные методы
    //Статичные методы
    //Приватные методы
    //Обычный метод
    //Статичные поля    (public static int staticField = 10;)
    //Приватные поля     (private int privateField;)
    //public static final int STATIC_CONSTANT = 100;


    //Обычный класс
//    Поля
//    Конструктор
//    Вложенные классы
//    Статические блоки
//    Статические методы
//    Приватные методы
//    Интерфейсы
//    Аннотации
//    enum
//    обычные методы
//    public static final int STATIC_CONSTANT = 100;

}
